"use strict"

/* Задача №1
Що потрапить в консоль?*/

let someVar = 0;
++someVar;

if (someVar) {
    console.log(someVar);
}

/*В консоль потрапить 1, тому що ми використовуємо інкремент який збільшує значення змінної на одиницю.
Початкове значення нуль, тому в консолі 1*/


/* Задача №2
За допомогою циклу FOR виведіть в консоль 10 рядків:
Пункт №1
Пункт №2
і т.д. */

let list = "Пункт №"
for (let i = 1; i < 11; ++i) {
    console.log(list + [i])
}

/*Створив змінну list зі значенням "Пункт №".
Далі створюю цикл з умовами: початок від 1 та закінчення на 10.
Вивожу в консоль змінну list з додаванням змінної (і)*/


/* Задача №3
Що потрапить в консоль ?
if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
    console.log('000');
} */

/* Обчислення відбуваєтся наступним чином:
 
1) Спочатку працюють оператори множення та ділення. Отримуємо:
(40 <= 10 || 15 < 5 && 10 <= "10" || 20 === "20") 

2) Далі працюють оператори порівняння, які повертають булеві значення. Отримуємо:
(false || false && true || false) 

3) Далі приорітет у оператора "та", який повертає true тільки якщо обидва значення дорівнюють true:
(false || false || false) 

4) Останній оператор "або", який проводить обчислення з ліва на право доки не знайде перше значення true. Якщо true не знайдено повертає останнє значення:
(false || false || false) 

ВІДПОВІДЬ : Зараз в консоль нічого не потрапляє. Щоб побачити в консолі '000', треба коригувати операнди чи замінити оператор "та" на "або". 
*/


/* Задача №4
Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
Функція не має повертати NaN, Infinite або помилку */


function calcDivide(a, b) {

    if (typeof a !== "number" || typeof b !== "number") {
        // showResult = "Задайте значення"
        console.log("Задайте значення")
    }
    else if (b === 0) {
        console.log("Ви не можете ділити на нуль. Спробуйте інше значення")
    }
    else {
        let showResult = a / b
        console.log("Результат ділення:" + " " + showResult)
    }

}
calcDivide(10, 2)
calcDivide()
calcDivide(10, 0)
calcDivide(10234, 222345567)

/*Задача №5
Створіть масив даних - 5 елементів, один з яких число 10
Обробіть масив за допомогою методу перебору
Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль*/

let dataArray = [5, 7, "green", " ", 10]
for (let i = 0; i < dataArray.length; ++i) {
    if (dataArray.includes(10)) {
        console.log("Ми знайшли десять")
    }
}

let nextArray = [4, 9, true, 10, "barabolya"]
nextArray.forEach(value => {
    if (value === 10) {
        console.log(value)
    }
})


